
start_text = 'Привет! Я - бот для продажи репетиторских услуг. Заполни свою анкету, чтобы привлечь учеников!'

main_menu_text = 'Главное меню'
cancel_text = 'Действие отменено'

request_already_sent_text = 'У вас уже есть активная заявка!'

input_role_text = 'Выбери свою роль:'
input_name_text = 'Введи свое имя:'
input_age_text = 'Введи свой возраст:'
input_photo_text = 'Отправь свое фото или нажми "Пропустить"(Фото увеличивает шансы на успех):'
input_subject_text = '''Введи список предметов, которые преподаешь через запятую
<i>(Например: Математика, Физика, Химия)</i>:'''
input_experience_text = 'Напиши, сколько лет преподаешь:'
input_info_text = 'Расскажи немного о себе(Не более 600 символов):'
input_contacts_text = 'Введи свои контакты:'
input_price_text = 'Введи цену за одно занятие:'

tutee_input_age = 'Введи свой возраст или возраст вашего ребенка:'
tutee_input_subject = '''Введи предметы, на которые ты ищешь репетитора через запятую:
<i>(Например: Математика, Физика, Химия)</i>:'''
tutee_input_place = 'Как тебе удобнее заниматься: онлайн или оффлайн?'
tutee_input_target = 'Введи цель, которую ты преследуешь:'
tutee_input_price = 'Введи предполагаемую цену за одно занятие:'

invalid_age_text = 'Возраст должен быть числом от 18 до 100! Попробуй снова:'
invalid_experience_text = 'Опыт должен быть числом больше 0! Попробуй снова:'
invalid_info_text = 'Текст не должен превышать 600 символов! Попробуй снова:'
invalid_price_text = 'Цена должна быть числом больше 0! Попробуй снова:'
invalid_place_text = 'Выбери тип обучения!'
invalid_target_text = 'Выбери цель обучения!'


questionnaire_filled_text = 'Анкета успешно заполнена!'

change_menu_text = 'Что хотите изменить?'
change_success_text = 'Успешно изменено!'

input_field_text = 'Введи новое значение или нажми "Отмена":'

profile_text = 'Ваш профиль:'
questionnaire_text = '''🖌Преподаватель: {name}  
🖌Возраст: {age}      
🖌Предмет: {subject}  
🖌Опыт: {experience} лет 
🖌О себе: {info}  

🖌Контакты: {contacts}    
🖌Стоимость услуги: {price} р./час   
       
{tags}
'''

tutee_profile_text = '''🖌Меня зовут: {name}  
🖌Возраст ученика: {age}  
🖌Предмет: {subject}  
🖌Удобно заниматься: {place}  
🖌Цель обучения: {target}  
🖌Контакты: {contacts}  
🖌Предполагаемая стоимость услуги: {price} р./час

{tags}
'''

want_to_put_request_text = 'Хотите отправить заявку на публикацию?'
request_sent_text = 'Заявка отправлена!'
request_rejected_text = 'Заявка отклонена! Причина: {reason}'

buy_posts_text = 'Вы можете купить размещение постов в чате в удобное для вас время! Для покупки пишите сюда: @{admin}'
